InformationRegisters/АгентыЦелевые.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АгентыЦелевые</Name>
			<Comment>Реестр агентов все звонки которым считаются целевыми</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаЦелевая</Name>
					<Comment>Точка для которой оператор является целевым</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачБлокировки</Name>
					<Comment>Дата и время начала блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонБлокировки</Name>
					<Comment>Дата и время окончания блокировки</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстБлокировки</Name>
					<Comment>Причина блокировки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИницаторБлокировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВизитнаяКарточка</Name>
					<Comment>Текст визитной карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПропущенныхКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеБлокироватьЗаЗвонкиОжидающиеОбработкиБолееСуток</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Внутренний целевой телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АгентыЦелевыеИст.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>АгентыЦелевыеИст</Name>
			<Comment>Реестр агентов все звонки которым считаются целевыми</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаЦелевая</Name>
					<Comment>Точка для которой оператор является целевым</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиЦелевые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Внутренний целевой телефон</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АгентыЦелевые/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	ТЗ = ЭтотОбъект.Выгрузить();

//Т.к. набор записывается дважды (удаление существующего, запись нового), исключи случай удаления существующего
//--------------------------------------------------------------------------------------------------------------
	Если ТЗ.Количество()= 0 Тогда
		Возврат
	КонецЕсли;
	
	Запись = ТЗ[0];
	
	ТекДата = ТекущаяДата();
	
//Найти открытый период и закрой его, если изменилась целевая точка
//-----------------------------------------------------------------
	Запрос = Новый Запрос("ВЫБРАТЬ Т.Период КАК Период, Т.Телефон КАК Телефон, Т.ТочкаЦелевая КАК ТочкаЦелевая  ИЗ РегистрСведений.АгентыЦелевыеИст.СрезПоследних(, Телефон = &Телефон) КАК Т");
	Запрос.УстановитьПараметр("Телефон",  Запись.Телефон);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Доступно = Выборка.ТочкаЦелевая <> Запись.ТочкаЦелевая;
	Если Доступно = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Зап = РегистрыСведений.АгентыЦелевыеИст.СоздатьМенеджерЗаписи();
	Зап.Период 	= Выборка.Период;
	Зап.Телефон = Выборка.Телефон;
	Зап.Прочитать();
	Если Зап.Выбран() Тогда
		Зап.Период 			= Выборка.Период;
		Зап.Телефон 		= Выборка.Телефон;
		Зап.ТочкаЦелевая 	= Выборка.ТочкаЦелевая;
		Зап.Окончание 		= ТекДата-1;
		Попытка
			Зап.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации("ПриЗаписи", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Телефон=%1, Период=%2, ТочкаЦелевая=%3, Окончание=%4", Зап.Телефон, Зап.Период, Зап.ТочкаЦелевая, Зап.Окончание), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
//Открой новый период, если изменилась точка целевая
//----------------------------------------------------	
	НЗ = РегистрыСведений.АгентыЦелевыеИст.СоздатьМенеджерЗаписи();
	НЗ.Телефон				= 	Запись.Телефон;
	НЗ.Период				= 	ТекДата;		
	НЗ.ТочкаЦелевая			=	Запись.ТочкаЦелевая;
	НЗ.Окончание	 		=	'00010101';
	
	Попытка 
		НЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("ПриЗаписи", УровеньЖурналаРегистрации.Ошибка, , СтрШаблон("Телефон = %1, Период = %2, ТочкаЦелевая = %3", НЗ.Телефон, НЗ.Период, НЗ.ТочкаЦелевая), ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры
